#+TITLE: Babel Introduction
#+AUTHOR: Eric Schulte, Dan Davison, Tom Dye
#+DATE: <2017-04-01 Sat>
#+LAYOUT: post
#+OPTIONS: ':t author:nil ^:{}
#+STARTUP: content
#+TAGS: org-mode babel
#+CATEGORIES: org-mode
#+HTML_HEAD: <style>pre, code {font-family: monospace;}</style>

*** [[http://www.r-project.org/][R]]
    当前这个文件中最常用的词是？
    在 =Org-mode= 文件中:
    : #+begin_src R :colnames yes
    :   words <- tolower(scan("babel-intro.org", what="", na.strings=c("|",":")))
    :   t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
    : #+end_src

    HTML 导出的代码:
    #+begin_src R :colnames yes
    words <- tolower(scan("babel-intro.org", what="", na.strings=c("|",":")))
    t(sort(table(words[nchar(words) > 3]), decreasing=TRUE)[1:10])
    #+end_src

    #+RESULTS:
    | code | org-mode | #+end_src | #+begin_src | block | #+name: | babel | that | this | with |
    |------+----------+-----------+-------------+-------+---------+-------+------+------+------|
    |   68 |       51 |        46 |          44 |    37 |      36 |    28 |   26 |   26 |   25 |

*** Example 2: Babel Test Suite
    While developing Babel, we used a suite of tests implemented
    as a large Org-mode table.  To run the entire test suite we simply
    evaluate the table with C-u C-c C-c: all of the tests are run,
    the results are compared with expectations, and the table is updated
    with results and pass/fail statistics.

    Here's a sample of our test suite.

    In the Org-mode file:

    : #+TBLNAME: org-babel-tests
    : | functionality    | block        | arg |    expected |     results | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | basic evaluation |              |     |             |             | pass |
    : |------------------+--------------+-----+-------------+-------------+------|
    : | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    : | shell            | basic-shell  |     |           6 |           6 | pass |
    : | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    : | python           | basic-python |     | hello world | hello world | pass |
    : | R                | basic-R      |     |          13 |          13 | pass |
    : #+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

    HTML export of code:
    #+TBLNAME: org-babel-tests
    | functionality    | block        | arg |    expected |     results | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | basic evaluation |              |     |             |             | pass |
    |------------------+--------------+-----+-------------+-------------+------|
    | emacs lisp       | basic-elisp  |   2 |           4 |           4 | pass |
    | shell            | basic-shell  |     |           6 |           6 | pass |
    | ruby             | basic-ruby   |     |   org-babel |   org-babel | pass |
    | python           | basic-python |     | hello world | hello world | pass |
    | R                | basic-R      |     |          13 |          13 | pass |
    #+TBLFM: $5='(if (= (length $3) 1) (sbe $2 (n $3)) (sbe $2)) :: $6='(if (string= $4 $5) "pass" (format "expected %S but was %S" $4 $5))

